#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
[command]/home/runner/work/_temp/ac44e872-9276-4f75-92ba-5a7d17363be8/terraform-bin plan -out=tfplan -no-color
module.s3_alb_logs.data.aws_partition.current: Reading...
module.s3_alb_logs.data.aws_region.current: Reading...
module.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]
aws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]
module.ecr.data.aws_partition.current: Reading...
module.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z07552261L3Y3JSSNSTHB]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]
module.ecr.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.s3_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.data.aws_caller_identity.current: Reading...
module.ecr.data.aws_caller_identity.current: Reading...
module.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecr.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]
module.ecr.data.aws_iam_policy_document.repository[0]: Reading...
module.ecr.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
aws_iam_role_policy.ecs_task_execution_ecr_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role:aidoctors-ecs-task-execution-ecr-policy]
module.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]
module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Reading...
module.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Reading...
module.s3_alb_logs.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Read complete after 0s [id=1261215049]
module.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Read complete after 0s [id=2281510643]
module.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Reading...
module.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2642795832]
module.s3_alb_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=aidoctors-alb-logs]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5b5757a4ad55762]
module.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03ed752e073dfbab3]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00181454359ad7fee]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]
module.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3263409970]
module.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3542370404]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-060bb021411c4af84]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-060795adfd71d2087]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.alb.data.aws_partition.current[0]: Reading...
module.alb.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=3ECwjw]
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-09a7c57f478f193d7]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-20251029162216762800000001]
module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]
module.alb.aws_lb_target_group.this["aidoctors-application"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739]
module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:loadbalancer/app/aidoctors-alb/6652fc2ac194375a]
module.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0be5005f96f1578a8]
module.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-01ef6dce0fbb665e9]
module.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-0b0fee6925a741f5d]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-058d551c3513cd7d4]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-YUAZASCKMEEFMFFXGN37R4GCT4]
module.alb.aws_lb_listener.this["ex-http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:listener/app/aidoctors-alb/6652fc2ac194375a/65282dea93f7061c]
module.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:521538197756:secret:rds!db-cbfeed5f-8f40-443b-9729-9c3f489f3b09-uO760T]
module.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]
aws_route53_record.root: Refreshing state... [id=Z07552261L3Y3JSSNSTHB_aidoctors.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.ecs will be created
  + resource "aws_cloudwatch_log_group" "ecs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/aidoctors"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "aidoctors-ecs-logs"
        }
      + tags_all          = {
          + "Name" = "aidoctors-ecs-logs"
        }
    }

  # aws_ecs_service.app will be created
  + resource "aws_ecs_service" "app" {
      + arn                                = (known after apply)
      + availability_zone_rebalancing      = (known after apply)
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "aidoctors-service"
      + platform_version                   = (known after apply)
      + region                             = "us-east-2"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "aidoctors-ecs-service"
        }
      + tags_all                           = {
          + "Name" = "aidoctors-ecs-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_configuration (known after apply)

      + load_balancer {
          + container_name   = "aidoctors-container"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739"
            # (1 unchanged attribute hidden)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-058d551c3513cd7d4",
            ]
          + subnets          = [
              + "subnet-073019d7ba4d1ac80",
              + "subnet-0c5b5757a4ad55762",
            ]
        }
    }

  # aws_ecs_task_definition.app will be created
  + resource "aws_ecs_task_definition" "app" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "521538197756.dkr.ecr.us-east-2.amazonaws.com/aidoctors-app:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/aidoctors"
                          + awslogs-region        = "us-east-2"
                          + awslogs-stream-prefix = "ecs"
                        }
                    }
                  + name             = "aidoctors-container"
                  + portMappings     = [
                      + {
                          + containerPort = 80
                          + hostPort      = 80
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = "arn:aws:iam::521538197756:role/aidoctors-ecs-task-execution-role"
      + family                   = "aidoctors-app"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + region                   = "us-east-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "aidoctors-task-definition"
        }
      + tags_all                 = {
          + "Name" = "aidoctors-task-definition"
        }
      + task_role_arn            = "arn:aws:iam::521538197756:role/aidoctors-ecs-task-role"
      + track_latest             = false
    }

  # aws_iam_role_policy.ecs_task_role_policy will be created
  + resource "aws_iam_role_policy" "ecs_task_role_policy" {
      + id          = (known after apply)
      + name        = "aidoctors-ecs-task-role-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*",
                          + "ecr:*",
                          + "ecs:*",
                          + "rds:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "aidoctors-ecs-task-role"
    }

  # module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/aidoctors-cluster"
      + name_prefix       = (known after apply)
      + region            = "us-east-2"
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Name" = "aidoctors-ecs-cluster"
        }
      + tags_all          = {
          + "Name" = "aidoctors-ecs-cluster"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "aidoctors-cluster"
      + region   = "us-east-2"
      + tags     = {
          + "Name" = "aidoctors-ecs-cluster"
        }
      + tags_all = {
          + "Name" = "aidoctors-ecs-cluster"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "DEFAULT"
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "aidoctors-cluster"
      + id                 = (known after apply)
      + region             = "us-east-2"

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE_SPOT"
          + weight            = 50
        }
      + default_capacity_provider_strategy {
          + base              = 20
          + capacity_provider = "FARGATE"
          + weight            = 50
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: module.s3_alb_logs.data.aws_partition.current: Reading...%0Amodule.s3_alb_logs.data.aws_region.current: Reading...%0Amodule.ecr.aws_ecr_repository.this[0]: Refreshing state... [id=aidoctors-app]%0Aaws_iam_role.ecs_task_role: Refreshing state... [id=aidoctors-ecs-task-role]%0Aaws_iam_role.ecs_task_execution_role: Refreshing state... [id=aidoctors-ecs-task-execution-role]%0Amodule.ecr.data.aws_partition.current: Reading...%0Amodule.route53_zone.aws_route53_zone.this["aidoctors.com"]: Refreshing state... [id=Z07552261L3Y3JSSNSTHB]%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05686e7dc52f8f6df]%0Amodule.ecr.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.s3_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.s3_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]%0Amodule.s3_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Reading...%0Amodule.ecr.data.aws_caller_identity.current: Reading...%0Amodule.s3_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecr.data.aws_caller_identity.current: Read complete after 0s [id=521538197756]%0Amodule.ecr.data.aws_iam_policy_document.repository[0]: Reading...%0Amodule.ecr.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=1578471098]%0Aaws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]%0Aaws_iam_role_policy.ecs_task_execution_ecr_policy: Refreshing state... [id=aidoctors-ecs-task-execution-role:aidoctors-ecs-task-execution-ecr-policy]%0Amodule.ecr.aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.ecr.aws_ecr_repository_policy.this[0]: Refreshing state... [id=aidoctors-app]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Reading...%0Amodule.s3_alb_logs.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Reading...%0Amodule.s3_alb_logs.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.lb_log_delivery[0]: Read complete after 0s [id=1261215049]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0]: Read complete after 0s [id=2281510643]%0Amodule.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Reading...%0Amodule.s3_alb_logs.data.aws_iam_policy_document.combined[0]: Read complete after 0s [id=2642795832]%0Amodule.s3_alb_logs.aws_s3_bucket_policy.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.s3_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Amodule.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0bf70d3f2fadcfb41]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0032386130964171e]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-043f4c0120570ae34]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-073019d7ba4d1ac80]%0Amodule.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-07efa2bcb551685bd]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083c0db3e1395fded]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc63c4d494374dd6]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5b5757a4ad55762]%0Amodule.rds_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-03ed752e073dfbab3]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09431dd1309dfe33a]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0f5eb680acf65fea3]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-07bf335ed55e1233f]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00181454359ad7fee]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f7d82a180ace47f4]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-038f6ff47eba184f5]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-030857cf79d386198]%0Amodule.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=aidoctors-vpc]%0Amodule.rds_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3263409970]%0Amodule.rds_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3542370404]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c43d4e8b4f48b114]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-060bb021411c4af84]%0Amodule.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-073ba5a5e32dc7574]%0Amodule.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-061c36c6e2b02f39c]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f7d82a180ace47f41080289494]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0bbaf291468d476f3]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-08ce7f62a5a36df2c]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e24a561bd9bff913]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-060795adfd71d2087]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09431dd1309dfe33a1080289494]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0f5eb680acf65fea31080289494]%0Amodule.db.module.db_instance.data.aws_partition.current: Reading...%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...%0Amodule.alb.data.aws_partition.current[0]: Reading...%0Amodule.alb.data.aws_partition.current[0]: Read complete after 0s [id=aws]%0Amodule.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]%0Amodule.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]%0Amodule.db.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=3ECwjw]%0Amodule.alb.aws_security_group.this[0]: Refreshing state... [id=sg-09a7c57f478f193d7]%0Amodule.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role]%0Amodule.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aidoctors-db-20251029162216762800000001]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/postgresql]%0Amodule.alb.aws_lb_target_group.this["aidoctors-application"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739]%0Amodule.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/aidoctors-db/upgrade]%0Amodule.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:loadbalancer/app/aidoctors-alb/6652fc2ac194375a]%0Amodule.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0be5005f96f1578a8]%0Amodule.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-01ef6dce0fbb665e9]%0Amodule.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-0b0fee6925a741f5d]%0Aaws_security_group.ecs_tasks: Refreshing state... [id=sg-058d551c3513cd7d4]%0Amodule.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=aidoctors-rds-monitoring-role/arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole]%0Amodule.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-YUAZASCKMEEFMFFXGN37R4GCT4]%0Amodule.alb.aws_lb_listener.this["ex-http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:521538197756:listener/app/aidoctors-alb/6652fc2ac194375a/65282dea93f7061c]%0Amodule.db.module.db_instance.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:521538197756:secret:rds!db-cbfeed5f-8f40-443b-9729-9c3f489f3b09-uO760T]%0Amodule.s3_alb_logs.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=aidoctors-alb-logs]%0Aaws_route53_record.root: Refreshing state... [id=Z07552261L3Y3JSSNSTHB_aidoctors.com_A]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_cloudwatch_log_group.ecs will be created%0A  + resource "aws_cloudwatch_log_group" "ecs" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/ecs/aidoctors"%0A      + name_prefix       = (known after apply)%0A      + region            = "us-east-2"%0A      + retention_in_days = 7%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Name" = "aidoctors-ecs-logs"%0A        }%0A      + tags_all          = {%0A          + "Name" = "aidoctors-ecs-logs"%0A        }%0A    }%0A%0A  # aws_ecs_service.app will be created%0A  + resource "aws_ecs_service" "app" {%0A      + arn                                = (known after apply)%0A      + availability_zone_rebalancing      = (known after apply)%0A      + cluster                            = (known after apply)%0A      + deployment_maximum_percent         = 200%0A      + deployment_minimum_healthy_percent = 100%0A      + desired_count                      = 0%0A      + enable_ecs_managed_tags            = false%0A      + enable_execute_command             = false%0A      + iam_role                           = (known after apply)%0A      + id                                 = (known after apply)%0A      + launch_type                        = "FARGATE"%0A      + name                               = "aidoctors-service"%0A      + platform_version                   = (known after apply)%0A      + region                             = "us-east-2"%0A      + scheduling_strategy                = "REPLICA"%0A      + tags                               = {%0A          + "Name" = "aidoctors-ecs-service"%0A        }%0A      + tags_all                           = {%0A          + "Name" = "aidoctors-ecs-service"%0A        }%0A      + task_definition                    = (known after apply)%0A      + triggers                           = (known after apply)%0A      + wait_for_steady_state              = false%0A%0A      + deployment_configuration (known after apply)%0A%0A      + load_balancer {%0A          + container_name   = "aidoctors-container"%0A          + container_port   = 80%0A          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:521538197756:targetgroup/aid20251029181402051700000002/4dbbca979682b739"%0A            # (1 unchanged attribute hidden)%0A        }%0A%0A      + network_configuration {%0A          + assign_public_ip = false%0A          + security_groups  = [%0A              + "sg-058d551c3513cd7d4",%0A            ]%0A          + subnets          = [%0A              + "subnet-073019d7ba4d1ac80",%0A              + "subnet-0c5b5757a4ad55762",%0A            ]%0A        }%0A    }%0A%0A  # aws_ecs_task_definition.app will be created%0A  + resource "aws_ecs_task_definition" "app" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = jsonencode(%0A            [%0A              + {%0A                  + essential        = true%0A                  + image            = "521538197756.dkr.ecr.us-east-2.amazonaws.com/aidoctors-app:latest"%0A                  + logConfiguration = {%0A                      + logDriver = "awslogs"%0A                      + options   = {%0A                          + awslogs-group         = "/ecs/aidoctors"%0A                          + awslogs-region        = "us-east-2"%0A                          + awslogs-stream-prefix = "ecs"%0A                        }%0A                    }%0A                  + name             = "aidoctors-container"%0A                  + portMappings     = [%0A                      + {%0A                          + containerPort = 80%0A                          + hostPort      = 80%0A                          + protocol      = "tcp"%0A                        },%0A                    ]%0A                },%0A            ]%0A        )%0A      + cpu                      = "256"%0A      + enable_fault_injection   = (known after apply)%0A      + execution_role_arn       = "arn:aws:iam::521538197756:role/aidoctors-ecs-task-execution-role"%0A      + family                   = "aidoctors-app"%0A      + id                       = (known after apply)%0A      + memory                   = "512"%0A      + network_mode             = "awsvpc"%0A      + region                   = "us-east-2"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags                     = {%0A          + "Name" = "aidoctors-task-definition"%0A        }%0A      + tags_all                 = {%0A          + "Name" = "aidoctors-task-definition"%0A        }%0A      + task_role_arn            = "arn:aws:iam::521538197756:role/aidoctors-ecs-task-role"%0A      + track_latest             = false%0A    }%0A%0A  # aws_iam_role_policy.ecs_task_role_policy will be created%0A  + resource "aws_iam_role_policy" "ecs_task_role_policy" {%0A      + id          = (known after apply)%0A      + name        = "aidoctors-ecs-task-role-policy"%0A      + name_prefix = (known after apply)%0A      + policy      = jsonencode(%0A            {%0A              + Statement = [%0A                  + {%0A                      + Action   = [%0A                          + "logs:CreateLogGroup",%0A                          + "logs:CreateLogStream",%0A                          + "logs:PutLogEvents",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                  + {%0A                      + Action   = [%0A                          + "s3:*",%0A                          + "ecr:*",%0A                          + "ecs:*",%0A                          + "rds:*",%0A                        ]%0A                      + Effect   = "Allow"%0A                      + Resource = "*"%0A                    },%0A                ]%0A              + Version   = "2012-10-17"%0A            }%0A        )%0A      + role        = "aidoctors-ecs-task-role"%0A    }%0A%0A  # module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created%0A  + resource "aws_cloudwatch_log_group" "this" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + log_group_class   = (known after apply)%0A      + name              = "/aws/ecs/aidoctors-cluster"%0A      + name_prefix       = (known after apply)%0A      + region            = "us-east-2"%0A      + retention_in_days = 90%0A      + skip_destroy      = false%0A      + tags              = {%0A          + "Name" = "aidoctors-ecs-cluster"%0A        }%0A      + tags_all          = {%0A          + "Name" = "aidoctors-ecs-cluster"%0A        }%0A    }%0A%0A  # module.ecs_cluster.aws_ecs_cluster.this[0] will be created%0A  + resource "aws_ecs_cluster" "this" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + name     = "aidoctors-cluster"%0A      + region   = "us-east-2"%0A      + tags     = {%0A          + "Name" = "aidoctors-ecs-cluster"%0A        }%0A      + tags_all = {%0A          + "Name" = "aidoctors-ecs-cluster"%0A        }%0A%0A      + configuration {%0A          + execute_command_configuration {%0A              + logging = "DEFAULT"%0A            }%0A        }%0A%0A      + setting {%0A          + name  = "containerInsights"%0A          + value = "enabled"%0A        }%0A    }%0A%0A  # module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created%0A  + resource "aws_ecs_cluster_capacity_providers" "this" {%0A      + capacity_providers = [%0A          + "FARGATE",%0A          + "FARGATE_SPOT",%0A        ]%0A      + cluster_name       = "aidoctors-cluster"%0A      + id                 = (known after apply)%0A      + region             = "us-east-2"%0A%0A      + default_capacity_provider_strategy {%0A          + base              = 0%0A          + capacity_provider = "FARGATE_SPOT"%0A          + weight            = 50%0A        }%0A      + default_capacity_provider_strategy {%0A          + base              = 20%0A          + capacity_provider = "FARGATE"%0A          + weight            = 50%0A        }%0A    }%0A%0APlan: 7 to add, 0 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Pusher: @TerryTian21, Action: `pull_request`, Workflow: `Terraform PR Check`*